In [174]:
import pandas as pd
import numpy as np
#create a data frame with some null values
df=pd.DataFrame({'Name':['pallavi','pallavi',np.nan,'rithk','helanikil'],'Grade':['first','first','second','fifth','fifth'],'FavoriteColor':['pink','pink','purple','voilet','pink'],'score':[9,9,7,6,7]})
df

        Name   Grade FavoriteColor  score
0    pallavi   first          pink      9
1    pallavi   first          pink      9
2        NaN  second        purple      7
3      rithk   fifth        voilet      6
4  helanikil   fifth          pink      7

In [175]:
df.duplicated()
#checking any duplicates exists

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [176]:
df.duplicated().sum()
#number of duplicate rows

1

In [177]:
df[df.duplicated()]
#gives duplicate rows

      Name  Grade FavoriteColor  score
1  pallavi  first          pink      9

In [178]:
df.drop_duplicates()
#deletes duplicates but doesn't reflect in df

        Name   Grade FavoriteColor  score
0    pallavi   first          pink      9
2        NaN  second        purple      7
3      rithk   fifth        voilet      6
4  helanikil   fifth          pink      7

In [179]:
df.isnull()
#checking any null values present

    Name  Grade  FavoriteColor  score
0  False  False          False  False
1  False  False          False  False
2   True  False          False  False
3  False  False          False  False
4  False  False          False  False

In [180]:
df.isnull().sum()
#it is showing two duplicates present in Name column

Name             1
Grade            0
FavoriteColor    0
score            0
dtype: int64

In [181]:
df['score'].aggregate(['sum', 'min'])

sum    38
min     6
Name: score, dtype: int64

In [182]:
df.aggregate({'score':['sum', 'min','max']})

     score
sum     38
min      6
max      9

In [183]:
df

        Name   Grade FavoriteColor  score
0    pallavi   first          pink      9
1    pallavi   first          pink      9
2        NaN  second        purple      7
3      rithk   fifth        voilet      6
4  helanikil   fifth          pink      7

In [184]:
df.groupby('FavoriteColor')['Name'].count()
#favouritecolor group by name

FavoriteColor
pink      3
purple    0
voilet    1
Name: Name, dtype: int64

In [185]:
dk=df.groupby('FavoriteColor').score.mean()
#dk.get_group('pink')
dk

FavoriteColor
pink      8.333333
purple    7.000000
voilet    6.000000
Name: score, dtype: float64

In [186]:
dk=df.groupby('FavoriteColor').score.sum()
#dk.get_group('pink')
dk

FavoriteColor
pink      25
purple     7
voilet     6
Name: score, dtype: int64

In [187]:
dk=df.groupby('FavoriteColor', group_keys=True).apply(lambda x: x)
dk

                      Name   Grade FavoriteColor  score
FavoriteColor
pink          0    pallavi   first          pink      9
              1    pallavi   first          pink      9
              4  helanikil   fifth          pink      7
purple        2        NaN  second        purple      7
voilet        3      rithk   fifth        voilet      6

In [188]:
#dk.get_group('pink')
#doesn't work on above statement, we need to have like this,
dk=df.groupby('FavoriteColor')
dk.get_group('pink')

        Name  Grade FavoriteColor  score
0    pallavi  first          pink      9
1    pallavi  first          pink      9
4  helanikil  fifth          pink      7

In [189]:
dt=df.groupby(['Grade','Name'], group_keys=True).apply(lambda x: x)
dt

                        Name  Grade FavoriteColor  score
Grade Name
fifth helanikil 4  helanikil  fifth          pink      7
      rithk     3      rithk  fifth        voilet      6
first pallavi   0    pallavi  first          pink      9
                1    pallavi  first          pink      9

In [190]:
df['Name'].str.len()

0    7.0
1    7.0
2    NaN
3    5.0
4    9.0
Name: Name, dtype: float64

In [191]:
df['Name'].str.len().idxmax()

4

In [192]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [193]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [196]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6